#ให้ทำโปรเเกรมคำนวนทาสีที่ต้องใช้ทาด้านนอกของกล่องสี่เหลร่ยมขนาดใหญ่ 1 กล่อง
#ว่าต้องใช้สีกี่เเกลอนโดยให้ผู้ใช้ป้อนความกว้าง ความยาว ความสูงของกล่อง (หน่วยเป็นเมตร) 
#ทางเเป้นพิมพ์เเละเเสดงผลจำนวนเเกลอนที่ต้องใช้ทางหน้าจอ ดังนี้
#กล่องขนาดกว้าง ?? เมตร ยาว ?? เมตร สูง ?? เมตร ใช้สีจำนวน ?? เเกลอน
#ทั้งนี้สี 1 เเกลอนทาได้ 5 ตารางเมตร ทั้งนี้จำนวนเเกลอนที่คำนวนได้หากเป็นเลขทศนิยมให้ปัดขึ้นเป็นเลขจำนวนเต็ม
#เช่น คำนวนได้ 15.239 เเกลอน เวลาเเสดงผลต้องเเสดงเป็น 16 เเกลอน
#ให้เเสดงผลโดยใช้ print ทั้ง 5 เเบบ
import math
w = float(input('ความกว้างของกล่อง (เมตร): '))
l = float(input('ความยาวของกล่อง (เมตร): '))
h = float(input('ความสูงของกล่อง (เมตร): '))

area = 2 * (w * h + l * h)

paint = math.ceil(area / 5)

print('กล่องขนาดกว้าง {:.2f} เมตร ยาว {:.2f} เมตร สูง {:.2f} เมตร'.format(w, l, h))
print('ใช้สีจำนวน {} แกลอน'.format(paint))
print("กล่องขนาดกว้าง " + f'{float(w):,.2f}' + " เมตร" + " ยาว " + f'{float(l):,.2f}' + " เมตร" + " สูง " + f'{float(h):,.2f}' + " เมตร")
print("ใช้สีจำนวน " + str(paint) + " แกลอน")
print(f"กล่องขนาดกว้าง {float(w):,.2f} เมตร ยาว {float(l):,.2f} เมตร สูง {float(h):,.2f} เมตร")
print(f'ใช้สีจำนวน {paint} แกลอน')
print("กล่องขนาดกว้าง",f'{float(w):,.2f}',"เมตร","ยาว",f'{float(l):,.2f}',"เมตร","สูง",f'{float(h):,.2f}',"เมตร")
print("ใช้สีจำนวน",str(paint),"แกลอน")
print('กล่องขนาดกว้าง %s เมตร ยาว %s เมตร สูง %s เมตร'%(f'{float(w):,.2f}',f'{float(l):,.2f}',f'{float(h):,.2f}'))
print('ใช้สีจำนวน %s แกลอน'%(paint))